backend/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
---
    def login
        user = User.find_by({username: params[:username]})