backend/app/controllers/dogs_controller.rb

    def index
        dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"